RocketSoapRequests.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:roc="http://example.com/rocketservice">
                                <soapenv:Header/>
                                <soapenv:Body>
                                    <roc:CreateRocketRequest>
                                        <externalId>5e9d0d95eda69955f709d1eb</externalId>
                                        <name>Falcon 1</name>
                                        <active>0</active>
                                        <stages>2</stages>
                                        <costPerLaunch>6700000</costPerLaunch>
                                        <description>The Falcon 1 was an expendable launch system privately developed and manufactured by SpaceX during 2006-2009. On 28 September 2008, Falcon 1 became the first privately-developed liquid-fuel launch vehicle to go into orbit around the Earth.</description>
                                    </roc:CreateRocketRequest>
                                </soapenv:Body>
                            </soapenv:Envelope>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:roc="http://example.com/rocketservice">
                                <soapenv:Header/>
                                <soapenv:Body>
                                    <roc:CreateRocketRequest>
                                        <externalId>5e9d0d95eda69973a809d1ec</externalId>
                                        <name>Falcon 9</name>
                                        <active>1</active>
                                        <stages>2</stages>
                                        <costPerLaunch>50000000</costPerLaunch>
                                        <description>Falcon 9 is a two-stage rocket designed and manufactured by SpaceX for the reliable and safe transport of satellites and the Dragon spacecraft into orbit.</description>
                                    </roc:CreateRocketRequest>
                                </soapenv:Body>
                            </soapenv:Envelope>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:roc="http://example.com/rocketservice">
                                <soapenv:Header/>
                                <soapenv:Body>
                                    <roc:CreateRocketRequest>
                                        <externalId>5e9d0d95eda69974db09d1ed</externalId>
                                        <name>Falcon Heavy</name>
                                        <active>1</active>
                                        <stages>2</stages>
                                        <costPerLaunch>90000000</costPerLaunch>
                                        <description>With the ability to lift into orbit over 54 metric tons (119,000 lb)--a mass equivalent to a 737 jetliner loaded with passengers, crew, luggage and fuel--Falcon Heavy can lift more than twice the payload of the next closest operational vehicle, the Delta IV Heavy, at one-third the cost.</description>
                                    </roc:CreateRocketRequest>
                                </soapenv:Body>
                            </soapenv:Envelope>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:roc="http://example.com/rocketservice">
                                <soapenv:Header/>
                                <soapenv:Body>
                                    <roc:CreateRocketRequest>
                                        <externalId>5e9d0d96eda699382d09d1ee</externalId>
                                        <name>Starship</name>
                                        <active>0</active>
                                        <stages>2</stages>
                                        <costPerLaunch>7000000</costPerLaunch>
                                        <description>Starship and Super Heavy Rocket represent a fully reusable transportation system designed to service all Earth orbit needs as well as the Moon and Mars. This two-stage vehicle — composed of the Super Heavy rocket (booster) and Starship (ship) — will eventually replace Falcon 9, Falcon Heavy and Dragon.</description>
                                    </roc:CreateRocketRequest>
                                </soapenv:Body>
                            </soapenv:Envelope>
